{"history": "Alright, so now I'm talking.Yeah, okay, there we go. It was just slightly misaligned. But yeah, I mean, it gets similar text, but the right side, the left side, as you can see, it just takes a little longer.So, what do you say to the resource that I'm talking about the payload that's being sent?b64 insaneSo I mean, I think what I did for this because of how annoying this was getting, I put a manual, it's not ideal, but...UmFor live, once the message received, I think yeah I do check whether it's thank you, if it's an empty message or thanks for watching. And then I think this is just for the live. I wasn't really getting that as much for the pause. But that kind of just a little bit of a little bit of outside thing that is kind of getting noise is getting out of it.Right.Mm-hmmYeah.The unconscious with the conscious.Thank you.Right, yes, everything's safe to JSON right now. Just that way I don't have to worry about like concurrency stuff. And I mean, this can be plugged in anywhere to any database. But let me just walk you through this really quick because there's a couple files just to kind of get this going. So.In terms of important parameters for this sample samples per frame, 1.024, I mean you don't have to touch much of this, 1600 is what Whisper expects, sample frames, 102 for as well Whisper expects as well. I guess what you can, if you want to go into the weeds, you can obviously adjust the buffer duration as well as the overlap size. I kept this 1200, 1200 in terms of 1.2 seconds because that was the lowest I could go while it kind of giving reasonable output just to make it seem like it's real time. Silence threshold is for the VAD, so the voice activity detection, so this willNo, sorry, it's not for design. It's to determine after last word is spent, how long to wait before to release the buffer if it doesn't meet the 1.5 second in terms of buffer data. So if I say like part of a word, how long to wait before I send that over, that kind of thing. In terms of, let's see, root mean, this is just like just calculating the actual value or just taking the mean, taking the root kind of thing. And then there's just some, like if it's no on stuff. So these are the two like high level conditions. Like if I'm above the threshold, so the threshold is over here, you can adjust to whatever you want, 200 is what I found from my headphones specifically, not even from my laptop, was getting. But if it does, if I do meet that, then I add that to the buffer. If I pass the buffer size, then I obviously send it over to my server here. Well, VM, whatever. And then from there, I just like whatever data I sent, I move that to the behind the buffer. And then the new data that's kind of being brought in is gonna be the new buffer in the future. Otherwise, this is just releasing the buffer early. So that's the rundown of this one. Climb pause, we already went over last time. If you want me to go over it again, I can, but. So the important.Sure, sure. A lot of this is very abstracted away. I mean, what client lives doing, client pause kind of abstracts away with the library, but the important part is really justIt's just two things, run and save. So run is basically, I'm using the speech recognition library, and this has its own built-in vad. It wants to detect some noise. This goes in infin-low. So I wanted to detect some noise, and I get the actual data, and I send it the server. That's it. And for this particular for client pause, all I'm doing is I'm just saving the history and history.pause in the JSON here. So there's nothing like, I don't have to worry about overlap or worse, because whenever I get a pause, I know that's one of the data gets sent. For client live, there's a queue in between. The reason for the queue, so I'm saving this to message queue live. And so it's just going to do like the snippets, which hopefully you can see if I just talk.Yeah, I don't know if you saw that, but yeah, but it and like what's happening is kind of taking it out of the queue, right? So I'm just sending those snipage and then in terms of addressing the actual queue. That's in the process messages live. It's a super bare bones algorithm, but what I'm doing is when I get a message from the queue, I'm just going to look at the past 10 words. So where is that in the code? Yeah, so a 10 new words only what I'm doing for first is just remove a punctuation because that just messes up the actual matching process and the punctuation on whisper when it's very short snippets is not good anyway. So basically I'm getting the previous 10 words and then I'm if the if in my new message, I see that there's words that are matching to the original history the past 10 words and I take those out because they're repeated words. I just then I just get all the previous history add the new updated words add that to history live and then streamless just going to see history live and history pause. So whatever front end you have, you just look at history live and history pause. The rest of it's been taken care of for you with the other programs. That was super fast. I guess any I can go over anything if you want me to again.Yeah.No, no, Streamlet app is this will be back to the client. So the client they yeah streamless like its own little microservice that's just gonna look at the data. Yeah, so this is this is once again as a simple as I could keep it just get get some data in right it doesn't know how much it doesn't know like it's just gonna get some bytes in as audio data it's gonna like convert it it's gonna normalize it because that's what Whisper expects that's what we're dividing by. The NumPy float like the maximum value and then it's just gonna try and scribe it and then return it so this one is like super as simple as it could be.And so the nice thing is like for client live and client pause, I'm using the same server file. So, yeah.Mm-hmmWoof WoofYeah.Yeah.Answers on the screen based on what they say, right?Right, yeah, that's exactly what I was imagining when you said this. So basically it just gives it, except it's for the company, it's not interview answers, is what you're saying.Right, right, right.Mm-hmmRightMm-hmmShh, shh, shh.ThinkingYeah, so I think you know I told you about my medical client, like the surgeons that I'm working with. I think so if you're going to go about searching based on medical history.UmLike what what what medical history is going to be there? I guess you know? Is it just like basic information?Right.Mm-hmmMm-hmmMm-hmmHaha Chiliowl. Brent.Mm-hmmThank you.Yeah.Yeah, so you're trying to represent, I guess, the person in the vector database and using the semantics like the cosine similarity to determine whenThat was just one instance basically that you gave me of like a logical fallacy but it could also be anything medical related like oh this they said this thing and they have This past medical thing which is similar to what like it seems like a similar thing in terms of meaning YeahThank you.Right.Yeah.Yeah.Thank you.Yeah.Right, I don't know if you've heard a Langerf. I saw this the other day and I was gonna send it to you, but umI'll send this over. I honestly haven't read it either, but I was going to send it to you. It was something about storing information in graph format and traversing through it. I don't know fully enough, but when I saw this, I think it connected to something you were talking about before. I think you were already building graphs using a string.Yeah.Oh yeah, that's what it was told me. Yeah, it's like a traverse up and down. Yeah.Bruh.Yeah.It's not a, it's not a graph. It's not a graph, it's not a graph, like, front. Yeah.Exactly. Yeah.Right.Thank you.Yeah, I haven't as much either. I wasn't thinking this was like, so you could have you could use like a semantic router for something like this, or you could literally just use an LM and like the nodes like what are like the lines between the edges can be like different like it could be like an edge with a word or like something like that to tell you where it should go based on the current scenario kind of thing. But that's I just came out of my mind. That's why I kind of gave it to you. I'll send her over, but yeah.Yeah.Mm-hmmI see. Yeah.Right.Mm-hmmMm-hmmYeah.Right, right.So the first part would be getting the di notification using open source model and the second part would be, I guess like we initially talked about, well once we di-dipify it then we can start using open AI again, right? The problem is that we can't use open AI for the di identification for HIPAA compliance. Yeah. Yeah. Okay. Mm-hmm. Mm-hmm. Mm-hmm. Mm-hmm. So let's say that an open source with run oh, this is not working. to run. Yeah, that's I can I can do that for you. Yeah, let me just I need to figure out how much time is going to take me and then from there I can get back to like tomorrow maybe.Thank you.Okay.Okay. Yeah, you're talking about what we're both trying to do on the fly. Yeah. Yeah.Right, right.Yeah, yeah, yeah. So in terms of on my on the scope from my side, do you want me to do? I'm assuming you want me to deploy this model. Do you also want me to take care of and like pulling it from your side and I Guess we're storing the data de-inertified and like I don't know like dynamo or something or s3 right? I'm assuming at some or do you want to do it on the fly?Thanks for watching!homescadows ?Redquery conditionalWait, when you say the stream, so one is going to be the actual conversation, right? That we just did, I'm guessing. And the other is going to be, when you say the records, is that like the stuff? Like we saw way back, like the sounds of you sent me.Putting all the lead before the A fury against usOkay.polys aren't as obvious as any other high loser meludo is technically not stains butThe seconds are trans... Okay, so I guess records is just like a high-level term though. It could really be anything. It could be like, as long as it's text data, that's really what... So, what I can assume...Okay, so I'll how about this for this project. I'll make the assumption that the the l-alam is going to accept some text data as a part of this endpoint. The do you want to like the saving part should we just keep that like out like the main things of the identification or do you want me to also take care of the saving part? Okay.Okay, you want to answer the line up? Yeah. VPC. And that way they don't ever leave the premise. Okay. Okay. Um. Yeah, I think that sounds good. Um. Do you want to meet tomorrow? I like three CST. How was that? Okay. Nice. G sent over and. So. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. That one was pretty like it was I like I was a pretty shitty. It was like very small and like the prompt was also, but what I, what I do with open source models, I mean, let me know what your thoughts. I built like a first, I feel first build of like a full eval set of just like, like in software engineering of like the test data and then offer that all kind of infer, infer it because the problem is when you like change a prompt a little bit with open source model, like you can completely change the whole thing. So even if like for one example, I fix it, I can just like, it could fuck up the rest of the data without me realizing. That's why I just build like a full evaluation thing and then do it. Do you know Raga's? Have you used Raga's before? Okay. Raga's is a rag evaluation framework that's kind of used. There's also Langsmith as well. Those are.Yeah, Langsmiths, all right. I mean we can go over the pros and cons to I guess Langsmiths. The problem is I personally just like using like a local test bench with JSON because it's less token heavy and there's just less moving parts Langsmiths, it does the same thing as Langsmiths that Raga's does except we choose evaluation metrics like I can show you there's like four metrics that Raga's uses but we can yeah, we can go over that Okay Sounds sounds good then. Do you want me to I'll push this over to your get Do you already have a repo? I'll do that right now or maybe in a bitOkay, do you all make it like a quick read me if your colleague or forgot your name. Sorry. What was it? Jerry yeah, Jerry. I'll make a quick read me for you or something that way you kind of know what's going onYeah, it's not too complicated, but it'll just make your life easier.Perfect.IYeah.While the text, while the live data is going.Yeah. This, I don't know if you already have this kind of board planned out, but this might help you. I kind of built this for another client of like a workflow. Because like we kind of just keep on going back and forth on ideas and I can kind of see you're kind of weighing out the different things. So you just build out a tree like this. I did this for like a client, I guess marketing company. But I'm assuming in your notebook you probably have something similar, but it's actually a global thing that could help you out. Let's see. Yeah. Right. Yeah. Okay. Yeah. Sounds good. All right. Talk soon then. Nice to meet you man. Bye.Thanks for watching!dishonestHello, this is a test. This is a test. Why the fuck is this not working?Testing now.Okay, so the server does just work fine.Casting.TestingTesting.Okay, so is this working?Hello?What the fuck? Why does this work?testingtestingtestingtestingtestingtestingTestingHoly shit, that is so fucking simple.All right, so that connection is done.Yep, this works.So test.Interesting.Hello.If I talk really fast, we'll get the calculator.TestingHelloAll right, so this transcription works.TestingThis is a WebSocket connection.TestingAlright, so this is working."}